haymanmk/general_purpose_remote_io/stm32f7xx_remote_io/Core/Src/api.c
#include "stm32f7xx_remote_io.h"

#define PARAM_STR_MAX_LENGTH    MAX_INT_DIGITS+2 // 1 for sign, 1 for null terminator


// function prototypes
void api_task(void *parameters);
token_t* api_create_token();
void api_free_tokens(token_t* token);
void api_reset_command_line();
io_status_t api_process_data();
void api_execute_command();
void api_error(uint16_t error_code);

// API task handle
TaskHandle_t apiTaskHandle;
extern TaskHandle_t processTxTaskHandle;

// ring buffer for received data
static char rxBuffer[API_RX_BUFFER_SIZE];
static uint8_t rxBufferHead = 0;
static uint8_t rxBufferTail = 0;

// ring buffer for sending data
static char txBuffer[API_TX_BUFFER_SIZE];
static uint8_t txBufferHead = 0;
static uint8_t txBufferTail = 0;

static command_line_t commandLine = {0}; // store command line data
static char paramBuffer[UART_TX_BUFFER_SIZE] = {'\0'}; // store data for ANY type
token_t* lastToken = NULL;               // store the last token

extern ws_color_t ws28xx_pwm_color[NUMBER_OF_LEDS];

SemaphoreHandle_t apiAppendTxSemaphoreHandle = NULL;

// initialize API task
void api_init()
{
    // create semacphore for appending data to tx buffer
    apiAppendTxSemaphoreHandle = xSemaphoreCreateBinary();

    // give semaphore
    xSemaphoreGive(apiAppendTxSemaphoreHandle);

    // initialize api task
    xTaskCreate(api_task, "API Task", configMINIMAL_STACK_SIZE * 2, NULL, tskIDLE_PRIORITY+1, &apiTaskHandle);
}

void api_task(void *parameters)
{
    for (;;)
    {
        // check if rx buffer is empty
        if (api_is_rx_buffer_empty() == STATUS_OK)
        {
            // wait for new data
            ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        }

        if (api_process_data() == STATUS_OK)
        {
            // execute the command
            api_execute_command();
        }
        else
        {
            while (rxBufferHead != rxBufferTail)
            {
                char chr = rxBuffer[rxBufferTail];
                // increment rx buffer tail
                api_increment_rx_buffer_tail();
                if (chr == '\n' || chr == '\r')
                {
                    break;
                }
            }
        }

        // free linked list of tokens
        api_free_tokens(commandLine.token);
        // clear the command line
        api_reset_command_line();
    }
}

// Append received data to buffer
io_status_t api_append_to_rx_ring_buffer(char *data, BaseType_t len)
{
    // append data to buffer
    for (uint8_t i = 0; i < len; i++)
    {
        // check if buffer is full
        if (api_is_rx_buffer_full() == STATUS_OK)
            return STATUS_FAIL;

        // append data to buffer
        rxBuffer[rxBufferHead] = data[i];
        api_increment_rx_buffer_head();
    }

    return STATUS_OK;
}

// Append data to tx buffer with specified length
io_status_t api_append_to_tx_ring_buffer(char *data, BaseType_t len)
{
    if (processTxTaskHandle == NULL)
    {
        return STATUS_FAIL;
    }

    // check if semaphore is created
    if (apiAppendTxSemaphoreHandle == NULL)
    {
        return STATUS_FAIL;
    }

    // take semaphore
    if (xSemaphoreTake(apiAppendTxSemaphoreHandle, portMAX_DELAY) != pdTRUE)
    {
        return STATUS_FAIL;
    }

    // append data to buffer
    for (uint8_t i = 0; i < len; i++)
    {
        // check if buffer is full
        if (api_is_tx_buffer_full() == STATUS_OK)
        {
            // give semaphore
            xSemaphoreGive(apiAppendTxSemaphoreHandle);
            return STATUS_FAIL;
        }

        // append data to buffer
        txBuffer[txBufferHead] = data[i];
        api_increment_tx_buffer_head();

        // notify tx task that there are new data to be sent
        xTaskNotifyGive(processTxTaskHandle);
    }

    // give semaphore
    xSemaphoreGive(apiAppendTxSemaphoreHandle);
    return STATUS_OK;
}

// Append data to buffer until terminator is met
io_status_t api_append_to_tx_ring_buffer_until_term(char *data, char terminator)
{
    if (processTxTaskHandle == NULL)
    {
        return STATUS_FAIL;
    }

    // check if semaphore is created
    if (apiAppendTxSemaphoreHandle == NULL)
    {
        return STATUS_FAIL;
    }

    // take semaphore
    if (xSemaphoreTake(apiAppendTxSemaphoreHandle, portMAX_DELAY) != pdTRUE)
    {
        return STATUS_FAIL;
    }

    // append data to buffer
    uint8_t i = 0;
    char chr = data[i];
    for (; chr != terminator; chr = data[++i])
    {
        // check if buffer is full
        while (api_is_tx_buffer_full() == STATUS_OK)
        {
            // wait until buffer is not full
            vTaskDelay(1);
        }

        // append data to buffer
        txBuffer[txBufferHead] = chr;
        api_increment_tx_buffer_head();

        // notify tx task that there are new data to be sent
        xTaskNotifyGive(processTxTaskHandle);
    }

    // give semaphore
    xSemaphoreGive(apiAppendTxSemaphoreHandle);

    return STATUS_OK;
}

// increment rx buffer head
io_status_t api_increment_rx_buffer_head()
{
    UTILS_INCREMENT_BUFFER_HEAD(rxBufferHead, rxBufferTail, API_RX_BUFFER_SIZE);
}

// increment rx buffer tail
io_status_t api_increment_rx_buffer_tail()
{
    UTILS_INCREMENT_BUFFER_TAIL(rxBufferTail, rxBufferHead, API_RX_BUFFER_SIZE);
}

// increment rx buffer tail or wait for new data
void api_increment_rx_buffer_tail_or_wait()
{
    uint8_t nextTail = (rxBufferTail + 1) % API_RX_BUFFER_SIZE;
    if (nextTail == rxBufferHead)
    {
        // wait for new data
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
    // increment rx buffer tail
    rxBufferTail = nextTail;
}

// check if rx buffer is empty
io_status_t api_is_rx_buffer_empty()
{
    return (rxBufferHead == rxBufferTail) ? STATUS_OK : STATUS_FAIL;
}

// check if rx buffer is full
io_status_t api_is_rx_buffer_full()
{
    return (((rxBufferHead + 1) % API_RX_BUFFER_SIZE) == rxBufferTail) ? STATUS_OK : STATUS_FAIL;
}

// increment tx buffer head
io_status_t api_increment_tx_buffer_head()
{
    UTILS_INCREMENT_BUFFER_HEAD(txBufferHead, txBufferTail, API_TX_BUFFER_SIZE);
}

// increment tx buffer tail
io_status_t api_increment_tx_buffer_tail()
{
    UTILS_INCREMENT_BUFFER_TAIL(txBufferTail, txBufferHead, API_TX_BUFFER_SIZE);
}

// check if tx buffer is empty
io_status_t api_is_tx_buffer_empty()
{
    return (txBufferHead == txBufferTail) ? STATUS_OK : STATUS_FAIL;
}

// check if tx buffer is full
io_status_t api_is_tx_buffer_full()
{
    return (((txBufferHead + 1) % API_TX_BUFFER_SIZE) == txBufferTail) ? STATUS_OK : STATUS_FAIL;
}

// pop data from tx buffer
char api_pop_tx_buffer()
{
    char chr = txBuffer[txBufferTail];
    if (api_increment_tx_buffer_tail() != STATUS_OK)
    {
        return '\0';
    }
    return chr;
}

// functions for tokenizing data
// create token
token_t* api_create_token()
{
    // create token
    token_t* token = (token_t*)pvPortMalloc(sizeof(token_t));
    if (token == NULL)
    {
        api_error(API_ERROR_CODE_FAIL_ALLOCATE_MEMORY_FOR_TOKEN);
        return NULL;
    }

    // initialize token
    token->type = 0;
    token->value_type = 0;
    token->any = NULL;
    token->next = NULL;

    return token;
}

// free linked list of tokens
void api_free_tokens(token_t* token)
{
    token_t* next = NULL;
    while (token != NULL)
    {
        next = token->next;
        token->next = NULL;
        vPortFree(token);
        token = next;
    }
}

