haymanmk/general_purpose_remote_io/stm32f7xx_remote_io/Core/Src/api.c
// reset command line
void api_reset_command_line()
{
    memset(&commandLine, 0, sizeof(command_line_t));
    lastToken = NULL;
}

// parse received data
io_status_t api_process_data()
{
    char chr = rxBuffer[rxBufferTail];          // current character
    char param_str[PARAM_STR_MAX_LENGTH] = {'\0'};
    bool isVariant = false;                     // check if there is a variant for the command
    bool isLengthRequired = false;              // check if length is required for the command


    //// [Commnad Type]: lexing the command type //////////////////////////////////
    // check if command type is valid
    switch (chr)
    {
    case 'W': case 'w': // write data
        commandLine.type = 'W';
        break;
    case 'R': case 'r': // read data
        commandLine.type = 'R';
        break;

    case '\n': case '\r': // end of command
        return STATUS_FAIL;

    default:
        api_error(API_ERROR_CODE_INVALID_COMMAND_TYPE);
        return STATUS_FAIL;
    }

    // increment rx buffer tail
    api_increment_rx_buffer_tail_or_wait();


    //// [ID].[Variant]: lexing the command id and variant ////////////////////////
    while (rxBufferHead != rxBufferTail)
    {
        chr = rxBuffer[rxBufferTail];

        if (chr >= '0' && chr <= '9')
        {
            if (isVariant)
            {
                commandLine.variant = commandLine.variant * 10 + (chr - '0');
            }
            else
            {
                commandLine.id = commandLine.id * 10 + (chr - '0');
            }
        }
        else if ((chr == '.') && (commandLine.id != 0))
        {
            if (!isVariant) isVariant = true;
            else
            {
                api_error(API_ERROR_CODE_INVALID_COMMAND_VARIANT);
                return STATUS_FAIL;
            }
        }
        else if ((chr == ' ') && (commandLine.id != 0))
        {
            if (isVariant && commandLine.variant == 0) isVariant = false;
            //remove all the blank spaces when processing the command
            API_REMOVE_BLANK_SPACES();
            // proceed to next parsing step
            break;
        }
        else if ((chr == '\n' || chr == '\r') && commandLine.id != 0)
        {
            // end of command line
            return STATUS_OK;
        }
        else
        {
            api_error(API_ERROR_CODE_INVALID_COMMAND_ID);
            return STATUS_FAIL;
        }

        // increment rx buffer tail
        api_increment_rx_buffer_tail_or_wait();
    }


    //// [Param]: lexing the parameters //////////////////////////////////////////
    token_t* token = api_create_token();

    // check if length parameter is required for the command
    switch (commandLine.id)
    {
    case SERVICE_ID_SERIAL:
        isLengthRequired = true;
        break;
    }

    // check if first character is a digit or a sign
    chr = rxBuffer[rxBufferTail];
    if (!isdigit(chr) && chr != '-')
    {
        api_error(API_ERROR_CODE_INVALID_COMMAND_PARAMETER);
        api_free_tokens(token);
        return STATUS_FAIL;
    }
    else
    {
        if (token == NULL)
        {
            return STATUS_FAIL;
        }

        // check if length is required for the command
        if (isLengthRequired)
        {
            token->type = TOKEN_TYPE_LENGTH;
        }
        else
        {
            token->type = TOKEN_TYPE_PARAM;
        }

        token->value_type = PARAM_TYPE_INT32;

        // add token to the linked list
        commandLine.token = token;
        lastToken = token;
    }

    uint8_t param_index = 0;
    bool isDecimal = false;
    bool isAParam = false;
    bool isError = false;

    while (rxBufferHead != rxBufferTail)
    {
        chr = rxBuffer[rxBufferTail];

        // process data based on the value type of the parameter
        // type of number
        if (token->value_type == PARAM_TYPE_INT32)
        {
            if (chr == '-' && param_index == 0)
            {
                param_str[param_index++] = chr;
            }
            else if (chr >= '0' && chr <= '9' && param_index < PARAM_STR_MAX_LENGTH)
            {
                param_str[param_index++] = chr;
            }
            else if ((chr == ' ') && (param_index > 0))
            {
                // end of parameter
                isAParam = true;
            }
            else if ((chr == '\r' || chr == '\n') && (token->type != TOKEN_TYPE_LENGTH) && (param_index > 0))
            {
                // end of parameter
                isAParam = true;
            }
            else if (chr == '.' && !isDecimal && param_index < PARAM_STR_MAX_LENGTH)
            {
                param_str[param_index++] = chr;
                isDecimal = true;
            }
            else
            {
                if (param_index >= PARAM_STR_MAX_LENGTH)
                {
                    api_error(API_ERROR_CODE_TOO_MANNY_DIGITS);
                }
                else
                {
                    api_error(API_ERROR_CODE_INVALID_COMMAND_PARAMETER);
                }
                isError = true;
                break;
            }
        }
        // ANY type, push any data into the parameter
        else if (token->value_type == PARAM_TYPE_ANY)
        {
            if (param_index < lastToken->i32)
            {
                paramBuffer[param_index++] = chr;
            }
            
            // check if it is the end of the parameter based on the length
            if (param_index >= lastToken->i32)
            {
                // check if next character is a `\r` or `\n`
                uint8_t nextTail = (rxBufferTail+1) % API_RX_BUFFER_SIZE;
                if (nextTail != rxBufferHead)
                {
                    char chr = rxBuffer[nextTail];
                    if (chr == '\n' || chr == '\r')
                    {
                        // end of parameter
                        isAParam = true;
                    }
                    else
                    {
                        api_error(API_ERROR_CODE_INVALID_COMMAND_PARAMETER);
                        isError = true;
                        break;
                    }
                }
                else // wait for new data
                {
                    API_WAIT_UNTIL_BUFFER_NOT_EMPTY();
                }
            }
        }

        // check if it is the end of the parameter
        if (isAParam)
        {
            // check if the parameter is a float
            if (isDecimal)
            {
                token->value_type = PARAM_TYPE_FLOAT;
                token->f = atof(param_str);
            }
            else if (token->value_type == PARAM_TYPE_INT32)
            {
                token->i32 = atoi(param_str);
            }
            else
            {
                token->any = &paramBuffer;
            }

            // reset parameters
            memset(param_str, '\0', sizeof(param_str));
            param_index = 0;
            isDecimal = false;
            isAParam = false;

            // check if it is the end of the command line
            // wait until rx buffer is not empty
            API_WAIT_UNTIL_BUFFER_NOT_EMPTY();

            // increment rx buffer tail
            api_increment_rx_buffer_tail_or_wait();
            // remove all the blank spaces when processing the command
            API_REMOVE_BLANK_SPACES();
            chr = rxBuffer[rxBufferTail];
            if ((chr == '\n' || chr == '\r') && (token->type != TOKEN_TYPE_LENGTH))
            {
                // increment rx buffer tail
                api_increment_rx_buffer_tail();
                // end of command line
                return STATUS_OK;
            }

