haymanmk/general_purpose_remote_io/stm32f7xx_remote_io/Core/Src/api.c
            // update the last token
            lastToken = token;

            // not the end of the command line. Create a new token.
            token = api_create_token();
            if (token == NULL)
            {
                api_error(API_ERROR_CODE_FAIL_ALLOCATE_MEMORY_FOR_TOKEN);
                isError = true;
                break;
            }

            // add new token to the linked list
            lastToken->next = token;

            // check if the type of the parameter is supposed to be any
            if (lastToken != NULL && lastToken->type == TOKEN_TYPE_LENGTH)
            {
                token->value_type = PARAM_TYPE_ANY;
            }
            else
            {
                token->value_type = PARAM_TYPE_INT32;
            }
        }
        else
        {
            // increment rx buffer tail
            api_increment_rx_buffer_tail_or_wait();
        }

    } // while loop

    // free linked list of tokens if there is an error
    if (isError)
    {
        return STATUS_FAIL;
    }

    // should not reach here
    api_error(API_ERROR_CODE_INVALID_COMMAND_PARAMETER);
    return STATUS_FAIL;
}

// execute the command
void api_execute_command()
{
    uint16_t error_code = 0;

    // execute the command
    switch (commandLine.id)
    {
    case SERVICE_ID_STATUS:
        // execute status command
        if (commandLine.type == 'R')
        {
            // send default response
            API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_SYSTEM_INFO:
        // execute system info command
        if (commandLine.type == 'R')
        {
            // print system info
            system_info_print();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_SERIAL:
        // execute serial command
        if (commandLine.type == 'W')
        {
            // search for the message token and ingore the length token
            token_t* token = commandLine.token;
            while (token != NULL)
            {
                if (token->value_type == PARAM_TYPE_ANY)
                {
                    break;
                }
                token = token->next;
            }
            // check if the token is found
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            }
            else
            {
                // send the message to the serial port
                uart_printf(CHANNEL_1, "%s", (char*)token->any);
                //clear param buffer
                memset(paramBuffer, '\0', sizeof(paramBuffer));
            }
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_INPUT:
        // execute input command
        if (commandLine.type == 'R')
        {
            // check if parameter is valid
            if (commandLine.token == NULL ||
                commandLine.token->value_type != PARAM_TYPE_INT32 ||
                commandLine.token->i32 == 0 ||
                commandLine.token->i32 >= DIGITAL_INPUT_MAX)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            // if the parameter equals to -1, read all the digital inputs
            if (commandLine.token->i32 == -1)
            {
                // read all the digital inputs
                uint32_t state = digital_input_read_all();
                // send the state to the client, format: "R<Service ID> <State>"
                api_printf("R%d %d\r\n", SERVICE_ID_INPUT, state);
            }
            // read the state of specified digital input
            else
            {
                bool state = digital_input_read((uint8_t)(commandLine.token->i32));
                // send the state to the client, format: "R<Service ID> <Input Index> <State>"
                api_printf("R%d %d %d\r\n", SERVICE_ID_INPUT, commandLine.token->i32, state);
            }
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_SUBSCRIBE_INPUT:
        // execute subscribe input command
        if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;
            while (token != NULL)
            {
                // check if parameter is valid
                if (token->value_type != PARAM_TYPE_INT32 ||
                token->i32 == 0 ||
                token->i32 >= DIGITAL_INPUT_MAX)
                {
                    error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                    break;
                }
                // subscribe to the digital input
                digital_input_subscribe(token->i32);
                token = token->next;
            }
            API_DEFAULT_RESPONSE();
        }
        else if (commandLine.type == 'R')
        {
            // print header
            api_printf("R%d ", SERVICE_ID_SUBSCRIBE_INPUT);
            // print current subscribed digital inputs
            digital_input_print_subscribed_inputs();
            // print new line
            api_printf("\r\n");
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_UNSUBSCRIBE_INPUT:
        // execute unsubscribe input command
        // check if token is valid
        if (commandLine.token == NULL)
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            break;
        }

        if (commandLine.type == 'W')
        {
            token_t* token = commandLine.token;
            while (token != NULL)
            {
                // check if parameter is valid
                if (token->value_type != PARAM_TYPE_INT32 ||
                token->i32 == 0 ||
                token->i32 >= DIGITAL_INPUT_MAX)
                {
                    error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                    break;
                }
                // unsubscribe to the digital input
                digital_input_unsubscribe(token->i32);
                token = token->next;
            }
            API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SERVICE_ID_OUTPUT:
    {
        // check if token is valid
        if (commandLine.token == NULL)
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            break;
        }

        token_t* token = commandLine.token;

        // get output index
        uint16_t output_index = token->i32;

        // check if parameter is valid
        if (output_index == 0 || output_index >= DIGITAL_OUTPUT_MAX)
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            break;
        }

        // execute output command
        if (commandLine.type == 'W')
        {
            // get the write value
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }
            bool state = (token->i32 > 0) ? true : false;
            
            // write to the digital output
            digital_output_write(output_index, state);

            API_DEFAULT_RESPONSE();
        }
        else if (commandLine.type == 'R')
        {
            if (output_index == -1)
            {
                // read all the digital outputs
                uint32_t state = digital_output_read_all();
                // send the state to the client, format: "R<Service ID> <State>"
                api_printf("R%d %d\r\n", SERVICE_ID_OUTPUT, state);
            }
            else
            {
                // read the state of specified digital output
                bool state = digital_output_read((uint8_t)output_index);
                // send the state to the client, format: "R<Service ID> <Output Index> <State>"
                api_printf("R%d %d %d\r\n", SERVICE_ID_OUTPUT, output_index, state);
            }
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    }
    case SERVICE_ID_PWM_WS28XX_LED:
    {
        // check if token is valid
        if (commandLine.token == NULL)
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            break;
        }

        token_t* token = commandLine.token;

        // get the LED index
        uint16_t led_index = token->i32;

        // check if parameter is valid
        if (led_index >= NUMBER_OF_LEDS)
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
            break;
        }

