haymanmk/general_purpose_remote_io/stm32f7xx_remote_io/Core/Src/api.c
        // execute WS28XX LED command
        if (commandLine.type == 'W')
        {
            // get the color of the LED
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            // get the color of the LED
            uint8_t r = (uint8_t)token->i32;
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            uint8_t g = (uint8_t)token->i32;
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            uint8_t b = (uint8_t)token->i32;

            // set the color of the LED
            ws28xx_pwm_set_color(r, g, b, led_index);
            // update the LED
            ws28xx_pwm_update();

            API_DEFAULT_RESPONSE();
        }
        else if (commandLine.type == 'R')
        {
            // read the color of the LED
            ws_color_t color = ws28xx_pwm_color[led_index];
            // send the color to the client, format: "R<Service ID> <LED Index> <R> <G> <B>"
            api_printf("R%d %d %d %d %d\r\n", SERVICE_ID_PWM_WS28XX_LED, led_index, color.r, color.g, color.b);
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    }
    case SETTING_ID_IP_ADDRESS:
        if (commandLine.type == 'R')
        {
            // send the IP address to the client, format: "R<Service ID> <IP Addr 1> <IP Addr 2> <IP Addr 3> <IP Addr 4>"
            // e.g. "R101 172 16 0 10"
            api_printf("R%d %d %d %d %d\r\n", SETTING_ID_IP_ADDRESS,
                        settings.ip_address_0, settings.ip_address_1,
                        settings.ip_address_2, settings.ip_address_3);
        }
        else if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;

            // write the IP address
            settings.ip_address_0 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.ip_address_1 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.ip_address_2 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.ip_address_3 = (uint8_t)(token->i32);

            // write the IP address
            if (flash_write_data_with_checksum(FLASH_SECTOR_SETTINGS, (uint8_t*)&settings, sizeof(settings_t)) != STATUS_OK)
            {
                error_code = API_ERROR_CODE_UPDATE_IP_FAILED;
            }
            else API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SETTING_ID_NETMASK:
        if (commandLine.type == 'R')
        {
            // send the netmask to the client, format: "R<Service ID> <Netmask 1> <Netmask 2> <Netmask 3> <Netmask 4>"
            // e.g. "R102 255 240 0 0"
            api_printf("R%d %d %d %d %d\r\n", SETTING_ID_NETMASK,
                        settings.netmask_0, settings.netmask_1,
                        settings.netmask_2, settings.netmask_3);
        }
        else if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;

            // write the netmask
            settings.netmask_0 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.netmask_1 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.netmask_2 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.netmask_3 = (uint8_t)(token->i32);

            // write the netmask
            if (flash_write_data_with_checksum(FLASH_SECTOR_SETTINGS, (uint8_t*)&settings, sizeof(settings_t)) != STATUS_OK)
            {
                error_code = API_ERROR_CODE_UPDATE_IP_FAILED;
            }
            else API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SETTING_ID_GATEWAY:
        if (commandLine.type == 'R')
        {
            // send the gateway to the client, format: "R<Service ID> <Gateway 1> <Gateway 2> <Gateway 3> <Gateway 4>"
            // e.g. "R103 172 16 0 1"
            api_printf("R%d %d %d %d %d\r\n", SETTING_ID_GATEWAY,
                        settings.gateway_0, settings.gateway_1,
                        settings.gateway_2, settings.gateway_3);
        }
        else if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;

            // write the gateway
            settings.gateway_0 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

