haymanmk/general_purpose_remote_io/stm32f7xx_remote_io/Core/Src/api.c
            settings.gateway_1 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.gateway_2 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.gateway_3 = (uint8_t)(token->i32);

            // write the gateway
            if (flash_write_data_with_checksum(FLASH_SECTOR_SETTINGS, (uint8_t*)&settings, sizeof(settings_t)) != STATUS_OK)
            {
                error_code = API_ERROR_CODE_UPDATE_IP_FAILED;
            }
            else API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SETTING_ID_MAC_ADDRESS:
        if (commandLine.type == 'R')
        {
            // send the MAC address to the client, format: "R<Service ID> <MAC Addr 1> <MAC Addr 2> <MAC Addr 3> <MAC Addr 4> <MAC Addr 5> <MAC Addr 6>"
            // e.g. "R104 0 0 0 0 0 0"
            api_printf("R%d %d %d %d %d %d %d\r\n", SETTING_ID_MAC_ADDRESS,
                        settings.mac_address_0, settings.mac_address_1,
                        settings.mac_address_2, settings.mac_address_3,
                        settings.mac_address_4, settings.mac_address_5);
        }
        else if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;

            // write the MAC address
            settings.mac_address_0 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.mac_address_1 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.mac_address_2 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.mac_address_3 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.mac_address_4 = (uint8_t)(token->i32);
            token = token->next;
            if (token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            settings.mac_address_5 = (uint8_t)(token->i32);

            // write the MAC address
            if (flash_write_data_with_checksum(FLASH_SECTOR_SETTINGS, (uint8_t*)&settings, sizeof(settings_t)) != STATUS_OK)
            {
                error_code = API_ERROR_CODE_UPDATE_IP_FAILED;
            }
            else API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    case SETTING_ID_TCP_PORT:
        if (commandLine.type == 'R')
        {
            // send the Ethernet port to the client, format: "R<Service ID> <Port>"
            // e.g. "R105 80"
            api_printf("R%d %d\r\n", SETTING_ID_ETHERNET_PORT, settings.tcp_port);
        }
        else if (commandLine.type == 'W')
        {
            // check if token is valid
            if (commandLine.token == NULL)
            {
                error_code = API_ERROR_CODE_INVALID_COMMAND_PARAMETER;
                break;
            }

            token_t* token = commandLine.token;

            // write the Ethernet port
            settings.tcp_port = (uint16_t)(token->i32);

            // write the Ethernet port
            if (flash_write_data_with_checksum(FLASH_SECTOR_SETTINGS, (uint8_t*)&settings, sizeof(settings_t)) != STATUS_OK)
            {
                error_code = API_ERROR_CODE_UPDATE_IP_FAILED; /////////////////////////////////////////////
            }
            else API_DEFAULT_RESPONSE();
        }
        else
        {
            error_code = API_ERROR_CODE_INVALID_COMMAND_TYPE;
        }
        break;
    default:
    {
        // debug print the command
        vLoggingPrintf("Command: %c.%d \r\n", commandLine.type, commandLine.id);
        api_printf("%c%d", commandLine.type, commandLine.id);
        if (commandLine.variant > 0)
        {
            vLoggingPrintf("Variant: %d \r\n", commandLine.variant);
            api_printf(".%d", commandLine.variant);
        }
        api_printf("\r\n");

        // print the parameters
        token_t* token = commandLine.token;
        while (token != NULL)
        {
            if (token->type == TOKEN_TYPE_LENGTH)
            {
                vLoggingPrintf("Length: %d \r\n", token->i32);
            }
            else
            {
                if (token->value_type == PARAM_TYPE_INT32)
                {
                    vLoggingPrintf("Param: %d \r\n", token->i32);
                }
                else if (token->value_type == PARAM_TYPE_FLOAT)
                {
                    vLoggingPrintf("Param: %f \r\n", token->f);
                }
                else // PARAM_TYPE_ANY
                {
                    vLoggingPrintf("Param: %s \r\n", (char*)token->any);
                    // clear the buffer
                    memset(paramBuffer, '\0', sizeof(paramBuffer));
                }
            }
            token = token->next;
        }

        break;
    }
    }

    // check if there is an error
    if (error_code != 0)
    {
        api_error(error_code);
    }
}

io_status_t api_printf(const char *format_string, ...)
{
    char buffer[API_TX_BUFFER_SIZE] = {'\0'};
    va_list args;
    va_start(args, format_string);
    vsnprintf(buffer, API_TX_BUFFER_SIZE, format_string, args);
    va_end(args);

    // append data to tx ring buffer
    if (api_append_to_tx_ring_buffer_until_term(buffer, '\0') != STATUS_OK)
    {
        // error handling
        vLoggingPrintf("Error: Append to TX buffer failed\n");
    }

    return STATUS_OK;
}

void api_error(uint16_t error_code)
{
    // print error code
    api_printf(ERROR_CODE_FORMAT, error_code);
    vLoggingPrintf("Error: %d\n", error_code);
}